[{"slug":"minds-garden","entry":{"title":"Mind’s Garden","thumbnail":{"url":"https://drive.google.com/uc?export=view&id=1U8hNtAx9JIjoRMPQ_bg2rOCPNKVm3xIw","alt":"Thumbnail for the Mind’s Garden project, some majestic and colorful trees sit on a hillside, and the sky is filled with geometric star fractals."},"contents":[{"type":"paragraph","text":"Mind’s Garden is a musical exploration game and immersive audio visualizer. The game, which takes place in a garden within your mind, allows you to import any song you want to play alongside. However, the song isn’t just an accessory to the game; it is the game! The song is broken into pieces and scattered throughout your “head”, and it is your task to find them and unite the song. As you search for the pieces of the song, don’t forget to take a look at the garden around you, and watch the plants as they interact with the music that’s playing. The game is free to download and play from our itch.io page!"},{"type":"link","text":"Mind’s Garden on itch.io","url":"https://jaristotle.itch.io/minds"},{"type":"image","url":"https://drive.google.com/uc?export=view&id=15mB9d-RX9UzIAhnh_1bFPu0Qn2Ue8V45","alt":"A forest scene from Mind’s Garden with trees changing color to the beat and dancing to the music."},{"type":"image","url":"https://drive.google.com/uc?export=view&id=1L2ZNK7MaBdvzST13dubecAR09RIj4Ccm","alt":"A lush but potentially hostile jungle scene from the Mind’s Garden game. Enjoy the music, but watch out for the carnivorous plants!"},{"type":"video","url":"https://www.youtube.com/watch?v=8VasHc0pNV0"},{"type":"subheading","text":"Process"},{"type":"paragraph","text":"I created Mind’s Garden with two of my classmates from the ATLAS Institute at CU Boulder. Jared Myers, Kara Metcalfe, and it was our undergraduate capstone project. We were given a 12 week long creation phase during the semester, and kept a weekly development blog the whole time! That development blog, or process log, can be found over on our GitHub repository for the project, which also contains all of the source code too!"},{"type":"link","text":"Mind’s Garden on GitHub","url":"https://github.com/peterrosenthal/minds-garden/tree/master/Process"},{"type":"image","url":"https://drive.google.com/uc?export=view&id=1KpvvItj7gLLr8opcTSAraD9Y4b0J7C60","alt":"A shot of the Mind’s Garden game during development."},{"type":"paragraph","text":"Kara focused mostly on creating all of the visual assets for the game like 3D models and shaders. Jared was the gameplay programmer, coding things such as the asset and objective placement around the map. For my part: I did a lot of programming too, but I focused more on the systems programming. I created things such as the game’s procedural terrain generation algorithm, as well as systems to manage all of our 800+ different colors and determine how those colors interacted with  songs. I was also responsible for creating the different builds of the game for different operating systems as I had the most access and experience with multiple operating systems other than Microsoft Windows. And to give my artistic skills a test, I designed and drew our logo for the game."},{"type":"image","url":"https://drive.google.com/uc?export=view&id=1dvP7iiiVPyf7V2jSixruJ3bEx-fe7sA0","alt":"The logo which I crafted for the Mind’s Garden game!"},{"type":"paragraph","text":"One of my main goals throughout the project was to always code with my teammates in mind. That meant that instead of just designing and developing “my parts” of the game, I’d create and share tools with my teammates so they could give direct hands on input on my designs. For example, I didn’t just create a piece of procedurally generated terrain, I created a tool to create a piece of procedurally generated terrain, and opened it up to my entire team to work together on designing the ground the player walks on. If you want to read more about all the million other small things we created for the game, check out our complete weekly development blog!"},{"type":"image","url":"https://drive.google.com/uc?export=view&id=1UIEbjlYGxRZPIZk1jF1p0k2YoNA_syvd","alt":"A desert scene found in the Mind’s Garden game. The various cacti of different sizes and shapes jump and dance to the music."},{"type":"image","url":"https://drive.google.com/uc?export=view&id=1CUTyyZ2D5a0QLm_FvTUrduGvHY2gLUcb","alt":"An ocean scene found in the Mind’s Garden game. The ground is filled with coral and fish fly through the water around and above you."},{"type":"subheading","text":"Tools"},{"type":"list","entries":["The Unity Game engine","C# programming language with the JetBrains Rider IDE","Spleeter source stems separation library","GNU Image Manipulation Program"]},{"type":"subheading","text":"Reception"},{"type":"paragraph","text":"Unfortunately due to the COVID-19 pandemic starting right as we were graduating, we never got the opportunity to show off our capstone project in person. We were able to show people over zoom though, and send people the link to download the game themselves, and despite the lack of in person experience, most people were still super excited about our concept and really enjoyed exploring our interactive garden world. We had enough different color schemes to choose from that there was something for everybody to love there too. And our simple controls made the game super easy to give to people of all ages; kids absolutely loved our game. However, our 12 week development time felt very cramped for such an ambitious project, and we didn’t get the chance to iron out every single bug. So while most people are able to play the game without ever encountering a bug, we’ve gotten too many reports of people not even being able to make it past the main menu to consider the game “bug free.” Even though the capstone project is long finished, I still hope to one day come back though and squash those last few remaining bugs."}]}}]